learn/opensource/playframework/try-scala-templates/test/groovy.benchmark.txt
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        Play!
Server Hostname:        localhost
Server Port:            8080

Document Path:          /application/groovy
Document Length:        2136 bytes

Concurrency Level:      50
Time taken for tests:   5.876 seconds
Complete requests:      1000
Failed requests:        0
Write errors:           0
Total transferred:      2488000 bytes
HTML transferred:       2136000 bytes
Requests per second:    170.18 [#/sec] (mean)
Time per request:       293.799 [ms] (mean)
Time per request:       5.876 [ms] (mean, across all concurrent requests)
Transfer rate:          413.50 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   2.6      1      71
Processing:   106  284  55.7    279     526
Waiting:       85  284  56.2    278     526
Total:        107  286  55.7    280     527

Percentage of the requests served within a certain time (ms)
  50%    280
  66%    290
  75%    300
  80%    306
  90%    327
  95%    407
  98%    460
  99%    473
 100%    527 (longest request)